"""
5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""

i = int(input('Введите номер буквы: '))
c = chr(i + 96)
print(f'Результат: {c}')
